import type {
  Education,
  Experience,
  Qualification,
} from "@/types/personFeatures";
import type { Review } from "@/types/reviews";
import type { Service } from "@/types/services";
import type { Faq } from "@/types/faq";

export const education: Education[] = [
  {
    id: 1,
    universityName: "Новосибирский государственный педагогический университет",
    year: "2020",
    faculty: "Специальное (дефектологическое) образование",
    degree: "Базовое образование",
  },
  {
    id: 2,
    universityName: "Новосибирский государственный медицинский университет",
    year: "2024",
    faculty: "Медицинская логопедия",
    degree: "Циклы переподготовки",
  },
  {
    id: 3,
    universityName: "Новосибирский государственный педагогический университет",
    year: "2026",
    faculty: "Специальное (дефектологическое) образование",
    degree: "Магистратура",
  },
];

export const experience: Experience[] = [
  {
    id: 1,
    workName: "Медицинский центр «Врачебная практика»",
    year: "2025",
    post: "Логопед",
  },
  {
    id: 2,
    workName: "Медицинский центр «Ментал»",
    year: "2025 — 2026",
    post: "Логопед",
  },
  {
    id: 3,
    workName: "Городская больница №2",
    year: "2025 — н. в.",
    post: "Медицинский логопед",
  },
];

export const qualification: Qualification[] = [
  {
    id: 1,
    placeName: "Центр «Кругозор»",
    year: "2025",
    post: "Курс логопедического массажа",
  },
  {
    id: 2,
    placeName: "Алтайский государственный медицинский университет",
    year: "2026",
    post: "Первичная специализированная аккредитация (Медицинский логопед)",
  },
];

export const mockFaqs: Faq[] = [
  {
    id: 1,
    title: "Как понять, какой формат работы нам подойдёт?",
    description:
      "Начните с диагностики: это 55–60 минут спокойного разбора ситуации. По итогам я дам понятное заключение и порекомендую, какой формат будет самым эффективным именно в вашем случае –интенсивный, поддерживающий или разовые занятия. Так вы не потратите силы и время на то, что сейчас не сработает.",
  },
  {
    id: 2,
    title: "Все занятия проходят онлайн? Насколько это эффективно?",
    description:
      "Да, все форматы – онлайн. Эффективность зависит не от формата, а от регулярности, правильной нагрузки и вовлечённости семьи. На онлайн-встречах я вижу мимику, темп речи, паузы, реакцию на задания – этого достаточно для качественной работы. Плюс онлайн удобно: не нужно тратить силы на дорогу, а близкие могут сразу участвовать в занятии и сразу получать инструкции, как помогать дома.",
  },
  {
    id: 3,
    title: "Нужна ли подготовка к диагностике или занятию?",
    description:
      "Особой подготовки не требуется. Желательно, чтобы человек был отдохнувшим и не сразу после тяжёлой процедуры или долгого обследования. Возьмите с собой любые результаты обследований (заключения врачей, выписки), если они есть – это поможет лучше понять картину. Если ничего нет – ничего страшного: я сориентируюсь по текущим возможностям.",
  },
  {
    id: 4,
    title: "Нужно ли присутствовать близким на занятии?",
    description:
      "Зависит от формата и состояния. На диагностике присутствие близкого часто важно. На регулярных занятиях это решается индивидуально.",
  },
];

export const mockServices: Service[] = [
  {
    id: 1,
    title: "Бесплатная консультация",
    price: 0,
    description:
      "На бесплатной консультации врач поможет вам определить причины заболевания",
  },
  {
    id: 2,
    title: "Первичный прием",
    price: 1000,
    description:
      "Первичный прием подразумевает знакомство с врачом и поиски причин расстройств, а так же определение вектора дальнейших сеансов",
  },
  {
    id: 3,
    title: "Повторный прием",
    price: 800,
    description:
      "Углубленное изучение причин расстройства и нахождение способов лечения",
  },
  {
    id: 4,
    title: "Короткая консультация",
    price: 500,
    description:
      "Короткая консультация поможет вам понять, что именно вызывает негативные и болезненные ощущения",
  },
  {
    id: 5,
    title: "Расширенная консультация",
    price: 1500,
    description:
      "На расширенной консультации вы сможете обсудить со специалистом все аспекты, которые волную вас и мешают полноценно жить",
  },
];

export const mockReviews: Review[] = [
  {
    id: 1,
    name: "Александра Радэ",
    text: "У меня были проблемы с мужем, мы друг друга просто не понимали и были на грани развода. Моя знакомая посоветовала обратиться к Ирине и прости семейную консультацию. Буквально за 3 сеанса Ирина помогла нам найти то, что мешало в семье. Теперь мы знаем над чем работать, как лучше понимать друг друга и работать над нашими отношениями. Большое спасибо!",
    date: "15.09.2025",
  },
  {
    id: 2,
    name: "Егор Кирцин",
    text: "Сказать спасибо — значит ничего не сказать! Я в восторге! У меня была продолжительная депрессия, с которой я поначалу пытался бороться сам, потому что боялся это с кем-то это обсуждать. Но мне посоветовали Ирину, и она открыла мне глаза на мои проблемы, я смогу найти источники моей депрессии и работать над ними. Теперь я знаю что делать, чтобы стать счастливым человеком!",
    date: "01.08.2025",
  },
  {
    id: 3,
    name: "Иван Слабнин",
    text: "Записался на сайте на бесплатную консультацию и знаете что... Я в восторге от этого специалиста! В один момент накопилось столько проблем и мыслей, что я не мог с этим справляться самостоятельно. Ирина помогла расставить все по полочкам, расставить приоритеты и работать над гармонией с самим собой. Бесконечно благодарю и рекомендую!",
    date: "13.07.2025",
  },
];
